tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1788_tdd.h
#define WPUA1                         522
#define WPUA2                         523
#define WPUA3                         524
#define WPUA4                         525
#define WPUA5                         526
#define WPUA6                         527
#define WPUA7                         528
#define WPUB0                         529
#define WPUB                          530
#define WPUB1                         531
#define WPUB2                         532
#define WPUB3                         533
#define WPUB4                         534
#define WPUB5                         535
#define WPUB6                         536
#define WPUB7                         537
#define WPUC0                         538
#define WPUC                          539
#define WPUC1                         540
#define WPUC2                         541
#define WPUC3                         542
#define WPUC4                         543
#define WPUC5                         544
#define WPUC6                         545
#define WPUC7                         546
#define WPUE                          547
#define WPUE3                         548
#define SSP1BUF                       549
#define BUF                           550
#define BUF0                          551
#define SSP1BUF0                      552
#define BUF1                          553
#define SSP1BUF1                      554
#define BUF2                          555
#define SSP1BUF2                      556
#define BUF3                          557
#define SSP1BUF3                      558
#define BUF4                          559
#define SSP1BUF4                      560
#define BUF5                          561
#define SSP1BUF5                      562
#define BUF6                          563
#define SSP1BUF6                      564
#define BUF7                          565
#define SSP1BUF7                      566
#define ADD0                          567
#define ADD                           568
#define SSP1ADD0                      569
#define SSP1ADD                       570
#define ADD1                          571
#define SSP1ADD1                      572
#define ADD2                          573
#define SSP1ADD2                      574
#define ADD3                          575
#define SSP1ADD3                      576
#define ADD4                          577
#define SSP1ADD4                      578
#define ADD5                          579
#define SSP1ADD5                      580
#define ADD6                          581
#define SSP1ADD6                      582
#define ADD7                          583
#define SSP1ADD7                      584
#define SSP1MSK0                      585
#define SSP1MSK                       586
#define MSK0                          587
#define MSK                           588
#define SSP1MSK1                      589
#define MSK1                          590
#define SSP1MSK2                      591
#define MSK2                          592
#define SSP1MSK3                      593
#define MSK3                          594
#define SSP1MSK4                      595
#define MSK4                          596
#define SSP1MSK5                      597
#define MSK5                          598
#define SSP1MSK6                      599
#define MSK6                          600
#define SSP1MSK7                      601
#define MSK7                          602
#define SSP1STAT                      603
#define BF                            604
#define UA                            605
#define R_nW                          606
#define S                             607
#define P                             608
#define D_nA                          609
#define CKE                           610
#define SMP                           611
#define SSP1CON1                      612
#define SSPM0                         613
#define SSPM                          614
#define SSPM1                         615
#define SSPM2                         616
#define SSPM3                         617
#define CKP                           618
#define SSPEN                         619
#define SSPOV                         620
#define WCOL                          621
#define SSP1CON2                      622
#define SEN                           623
#define RSEN                          624
#define PEN                           625
#define RCEN                          626
#define ACKEN                         627
#define ACKDT                         628
#define ACKSTAT                       629
#define GCEN                          630
#define SSP1CON3                      631
#define DHEN                          632
#define AHEN                          633
#define SBCDE                         634
#define SDAHT                         635
#define BOEN                          636
#define SCIE                          637
#define PCIE                          638
#define ACKTIM                        639
#define ODCONA0                       640
#define ODCONA                        641
#define ODCONA1                       642
#define ODCONA2                       643
#define ODCONA3                       644
#define ODCONA4                       645
#define ODCONA5                       646
#define ODCONA6                       647
#define ODCONA7                       648
#define ODCONB0                       649
#define ODCONB                        650
#define ODCONB1                       651
#define ODCONB2                       652
#define ODCONB3                       653
#define ODCONB4                       654
#define ODCONB5                       655
#define ODCONB6                       656
#define ODCONB7                       657
#define ODCONC0                       658
#define ODCONC                        659
#define ODCONC1                       660
#define ODCONC2                       661
#define ODCONC3                       662
#define ODCONC4                       663
#define ODCONC5                       664
#define ODCONC6                       665
#define ODCONC7                       666
#define CCPR1L                        667
#define CCPR1H                        668
#define CCP1CON                       669
#define CCP1M0                        670
#define CCP1M                         671
#define CCP1M1                        672
#define CCP1M2                        673
#define CCP1M3                        674
#define DC1B                          675
#define DC1B0                         676
#define DC1B1                         677
#define CCPR2L                        678
#define CCPR2H                        679
#define CCP2CON                       680
#define CCP2M                         681
#define CCP2M0                        682
#define CCP2M1                        683
#define CCP2M2                        684
#define CCP2M3                        685
#define DC2B0                         686
#define DC2B                          687
#define DC2B1                         688
#define SLRCONA0                      689
#define SLRCONA                       690
#define SLRCONA1                      691
#define SLRCONA2                      692
#define SLRCONA3                      693
#define SLRCONA4                      694
#define SLRCONA5                      695
#define SLRCONA6                      696
#define SLRCONA7                      697
#define SLRCONB                       698
#define SLRCONB0                      699
#define SLRCONB1                      700
#define SLRCONB2                      701
#define SLRCONB3                      702
#define SLRCONB4                      703
#define SLRCONB5                      704
#define SLRCONB6                      705
#define SLRCONB7                      706
#define SLRCONC                       707
#define SLRCONC0                      708
#define SLRCONC1                      709
#define SLRCONC2                      710
#define SLRCONC3                      711
#define SLRCONC4                      712
#define SLRCONC5                      713
#define SLRCONC6                      714
#define SLRCONC7                      715
#define CCPR3L                        716
#define CCPR3H                        717
#define CCP3CON                       718
#define CCP3M                         719
#define CCP3M0                        720
#define CCP3M1                        721
#define CCP3M2                        722
#define CCP3M3                        723
#define DC3B                          724
#define DC3B0                         725
#define DC3B1                         726
#define INLVLA                        727
#define INLVLA0                       728
#define INLVLA1                       729
#define INLVLA2                       730
#define INLVLA3                       731
#define INLVLA4                       732
#define INLVLA5                       733
#define INLVLA6                       734
#define INLVLA7                       735
#define INLVLB                        736
#define INLVLB0                       737
#define INLVLB1                       738
#define INLVLB2                       739
#define INLVLB3                       740
#define INLVLB4                       741
#define INLVLB5                       742
#define INLVLB6                       743
#define INLVLB7                       744
#define INLVLC                        745
#define INLVLC0                       746
#define INLVLC1                       747
#define INLVLC2                       748
#define INLVLC3                       749
#define INLVLC4                       750
#define INLVLC5                       751
#define INLVLC6                       752
#define INLVLC7                       753
#define INLVLE                        754
#define INLVLE3                       755
#define IOCAP                         756
#define IOCAP0                        757
#define IOCAP1                        758
#define IOCAP2                        759
#define IOCAP3                        760
#define IOCAP4                        761
#define IOCAP5                        762
#define IOCAP6                        763
#define IOCAP7                        764
#define IOCAN                         765
#define IOCAN0                        766
#define IOCAN1                        767
#define IOCAN2                        768
#define IOCAN3                        769
#define IOCAN4                        770
#define IOCAN5                        771
#define IOCAN6                        772
#define IOCAN7                        773
#define IOCAF0                        774
#define IOCAF                         775
#define IOCAF1                        776
#define IOCAF2                        777
#define IOCAF3                        778
#define IOCAF4                        779
#define IOCAF5                        780
#define IOCAF6                        781
#define IOCAF7                        782
#define IOCBP                         783
#define IOCBP0                        784
#define IOCBP1                        785
#define IOCBP2                        786
#define IOCBP3                        787
#define IOCBP4                        788
#define IOCBP5                        789
#define IOCBP6                        790
#define IOCBP7                        791
#define IOCBN0                        792
#define IOCBN                         793
#define IOCBN1                        794
#define IOCBN2                        795
#define IOCBN3                        796
#define IOCBN4                        797
#define IOCBN5                        798
#define IOCBN6                        799
#define IOCBN7                        800
#define IOCBF0                        801
#define IOCBF                         802
#define IOCBF1                        803
#define IOCBF2                        804
#define IOCBF3                        805
#define IOCBF4                        806
#define IOCBF5                        807
#define IOCBF6                        808
#define IOCBF7                        809
#define IOCCP0                        810
#define IOCCP                         811
#define IOCCP1                        812
#define IOCCP2                        813
#define IOCCP3                        814
#define IOCCP4                        815
#define IOCCP5                        816
#define IOCCP6                        817
#define IOCCP7                        818
#define IOCCN0                        819
#define IOCCN                         820
#define IOCCN1                        821
#define IOCCN2                        822
#define IOCCN3                        823
#define IOCCN4                        824
#define IOCCN5                        825
#define IOCCN6                        826
#define IOCCN7                        827
#define IOCCF0                        828
#define IOCCF                         829
#define IOCCF1                        830
#define IOCCF2                        831
#define IOCCF3                        832
#define IOCCF4                        833
#define IOCCF5                        834
#define IOCCF6                        835
#define IOCCF7                        836
#define IOCEP                         837
#define IOCEP3                        838
#define IOCEN                         839
#define IOCEN3                        840
#define IOCEF                         841
#define IOCEF3                        842
#define OPA1CON                       843
#define OPA1CON_PCH                   844
#define OPA1PCH                       845
#define OPA1CON_PCH0                  846
#define OPA1PCH0                      847
#define OPA1CON_PCH1                  848
#define OPA1PCH1                      849
#define OPA1PCH2                      850
#define OPA1CON_PCH2                  851
#define OPA1CON_SP                    852
#define OPA1SP                        853
#define OPA1CON_EN                    854
#define OPA1EN                        855
#define OPA2CON                       856
#define OPA2CON_PCH                   857
#define OPA2CON_PCH0                  858
#define OPA2PCH                       859
#define OPA2PCH0                      860
#define OPA2CON_PCH1                  861
#define OPA2PCH1                      862
#define OPA2CON_PCH2                  863
#define OPA2PCH2                      864
#define OPA2CON_SP                    865
#define OPA2SP                        866
#define OPA2EN                        867
#define OPA2CON_EN                    868
#define CLKRCON                       869
#define CLKRDIV                       870
#define CLKRDIV0                      871
#define CLKRDIV1                      872
#define CLKRDIV2                      873
#define CLKRDC                        874
#define CLKRDC0                       875
#define CLKRDC1                       876
#define CLKRSLR                       877
#define CLKROE                        878
#define CLKREN                        879
#define DAC2CON0                      880
#define DAC2PSS                       881
#define DAC2OE2                       882
#define DAC2OE1                       883
#define DAC2EN                        884
#define DAC2REF                       885
#define DAC2R                         886
#define DAC3CON0                      887
#define DAC3PSS                       888
#define DAC3OE2                       889
#define DAC3OE1                       890
#define DAC3EN                        891
#define DAC3REF                       892
#define DAC3R                         893
#define DAC4CON0                      894
#define DAC4PSS                       895
#define DAC4OE2                       896
#define DAC4OE1                       897
#define DAC4EN                        898
#define DAC4REF                       899
#define DAC4R                         900
#define PSMC1CON                      901
#define P1MODE                        902
#define P1MODE0                       903
#define P1MODE1                       904
#define P1MODE2                       905
#define P1MODE3                       906
#define P1DBRE                        907
#define P1DBFE                        908
#define PSMC1LD                       909
#define PSMC1EN                       910
#define PSMC1MDL                      911
#define P1MSRC0                       912
#define P1MSRC                        913
#define P1MSRC1                       914
#define P1MSRC2                       915
#define P1MSRC3                       916
#define P1MDLBIT                      917
#define P1MDLPOL                      918
#define P1MDLEN                       919
#define PSMC1SYNC                     920
#define P1SYNC0                       921
#define P1SYNC1                       922
#define P1SYNC2                       923
#define P1DCPOL                       924
#define P1PRPOL                       925
#define P1POFST                       926
#define PSMC1CLK                      927
#define P1CSRC                        928
#define P1CSRC0                       929
#define P1CSRC1                       930
#define P1CPRE                        931
#define P1CPRE0                       932
#define P1CPRE1                       933
#define PSMC1OEN                      934
#define P1OEA                         935
#define P1OEB                         936
#define P1OEC                         937
#define P1OED                         938
#define P1OEE                         939
#define P1OEF                         940
#define PSMC1POL                      941
#define P1POLA                        942
#define P1POLB                        943
#define P1POLC                        944
#define P1POLD                        945
#define P1POLE                        946
#define P1POLF                        947
#define P1INPOL                       948
#define PSMC1BLNK                     949
#define P1REBM                        950
#define P1REBM0                       951
#define P1REBM1                       952
#define P1FEBM0                       953
#define P1FEBM                        954
#define P1FEBM1                       955
#define PSMC1REBS                     956
#define P1REBSC1                      957
#define P1REBSC2                      958
#define P1REBSC3                      959
#define P1REBSC4                      960
#define P1REBSIN                      961
#define PSMC1FEBS                     962
#define P1FEBSC1                      963
#define P1FEBSC2                      964
#define P1FEBSC3                      965
#define P1FEBSC4                      966
#define P1FEBSIN                      967
#define PSMC1PHS                      968
#define P1PHST                        969
#define P1PHSC1                       970
#define P1PHSC2                       971
#define P1PHSC3                       972
#define P1PHSC4                       973
#define P1PHSIN                       974
#define PSMC1DCS                      975
#define P1DCST                        976
#define P1DCSC1                       977
#define P1DCSC2                       978
#define P1DCSC3                       979
#define P1DCSC4                       980
#define P1DCSIN                       981
#define PSMC1PRS                      982
#define P1PRST                        983
#define P1PRSC1                       984
#define P1PRSC2                       985
#define P1PRSC3                       986
#define P1PRSC4                       987
#define P1PRSIN                       988
#define PSMC1ASDC                     989
#define P1ASDOV                       990
#define P1ARSEN                       991
#define P1ASDEN                       992
#define P1ASE                         993
#define PSMC1ASDL                     994
#define P1ASDLA                       995
#define P1ASDLB                       996
#define P1ASDLC                       997
#define P1ASDLD                       998
#define P1ASDLE                       999
#define P1ASDLF                       1000
#define PSMC1ASDS                     1001
#define P1ASDSC1                      1002
#define P1ASDSC2                      1003
#define P1ASDSC3                      1004
#define P1ASDSC4                      1005
#define P1ASDSIN                      1006
#define PSMC1INT                      1007
#define P1TPRIF                       1008
#define P1TDCIF                       1009
#define P1TPHIF                       1010
#define P1TOVIF                       1011
#define P1TPRIE                       1012
#define P1TDCIE                       1013
#define P1TPHIE                       1014
#define P1TOVIE                       1015
#define PSMC1PHL                      1016
#define PSMC1PH0                      1017
#define PSMC1PH1                      1018
#define PSMC1PH2                      1019
#define PSMC1PH3                      1020
#define PSMC1PH4                      1021
#define PSMC1PH5                      1022
#define PSMC1PH6                      1023
#define PSMC1PH7                      1024
#define PSMC1PHH                      1025
#define PSMC1PH8                      1026
#define PSMC1PH9                      1027
#define PSMC1PH10                     1028
#define PSMC1PH11                     1029
#define PSMC1PH12                     1030
#define PSMC1PH13                     1031
#define PSMC1PH14                     1032
#define PSMC1PH15                     1033
#define PSMC1DCL                      1034
#define PSMC1DC0                      1035
#define PSMC1DC1                      1036
#define PSMC1DC2                      1037
#define PSMC1DC3                      1038
#define PSMC1DC4                      1039
#define PSMC1DC5                      1040
#define PSMC1DC6                      1041
#define PSMC1DC7                      1042
#define PSMC1DCH                      1043
#define PSMC1DC8                      1044
#define PSMC1DC9                      1045
#define PSMC1DC10                     1046
#define PSMC1DC11                     1047
#define PSMC1DC12                     1048
#define PSMC1DC13                     1049
#define PSMC1DC14                     1050
#define PSMC1DC15                     1051
#define PSMC1PRL                      1052
#define PSMC1PR0                      1053
#define PSMC1PR1                      1054
#define PSMC1PR2                      1055
#define PSMC1PR3                      1056
#define PSMC1PR4                      1057
#define PSMC1PR5                      1058
#define PSMC1PR6                      1059
#define PSMC1PR7                      1060
#define PSMC1PRH                      1061
#define PSMC1PR8                      1062
#define PSMC1PR9                      1063
#define PSMC1PR10                     1064
#define PSMC1PR11                     1065
#define PSMC1PR12                     1066
#define PSMC1PR13                     1067
#define PSMC1PR14                     1068
#define PSMC1PR15                     1069
#define PSMC1TMRL                     1070
#define PSMC1TMR0                     1071
#define PSMC1TMR1                     1072
#define PSMC1TMR2                     1073
#define PSMC1TMR3                     1074
#define PSMC1TMR4                     1075
#define PSMC1TMR5                     1076
#define PSMC1TMR6                     1077
#define PSMC1TMR7                     1078
#define PSMC1TMRH                     1079
#define PSMC1TMR8                     1080
#define PSMC1TMR9                     1081
#define PSMC1TMR10                    1082
#define PSMC1TMR11                    1083
#define PSMC1TMR12                    1084
#define PSMC1TMR13                    1085
#define PSMC1TMR14                    1086
#define PSMC1TMR15                    1087
#define PSMC1DBR                      1088
#define PSMC1DBR0                     1089
#define PSMC1DBR1                     1090
