tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1788_tdd.h
#define PSMC1DBR2                     1091
#define PSMC1DBR3                     1092
#define PSMC1DBR4                     1093
#define PSMC1DBR5                     1094
#define PSMC1DBR6                     1095
#define PSMC1DBR7                     1096
#define PSMC1DBF                      1097
#define PSMC1DBF0                     1098
#define PSMC1DBF1                     1099
#define PSMC1DBF2                     1100
#define PSMC1DBF3                     1101
#define PSMC1DBF4                     1102
#define PSMC1DBF5                     1103
#define PSMC1DBF6                     1104
#define PSMC1DBF7                     1105
#define PSMC1BLKR                     1106
#define PSMC1BLKR0                    1107
#define PSMC1BLKR1                    1108
#define PSMC1BLKR2                    1109
#define PSMC1BLKR3                    1110
#define PSMC1BLKR4                    1111
#define PSMC1BLKR5                    1112
#define PSMC1BLKR6                    1113
#define PSMC1BLKR7                    1114
#define PSMC1BLKF                     1115
#define PSMC1BLKF0                    1116
#define PSMC1BLKF1                    1117
#define PSMC1BLKF2                    1118
#define PSMC1BLKF3                    1119
#define PSMC1BLKF4                    1120
#define PSMC1BLKF5                    1121
#define PSMC1BLKF6                    1122
#define PSMC1BLKF7                    1123
#define PSMC1FFA                      1124
#define PSMC1FFA0                     1125
#define PSMC1FFA1                     1126
#define PSMC1FFA2                     1127
#define PSMC1FFA3                     1128
#define PSMC1STR0                     1129
#define P1STRA                        1130
#define P1STRB                        1131
#define P1STRC                        1132
#define P1STRD                        1133
#define P1STRE                        1134
#define P1STRF                        1135
#define PSMC1STR1                     1136
#define P1HSMEN                       1137
#define P1LSMEN                       1138
#define P1SSYNC                       1139
#define PSMC2CON                      1140
#define P2MODE                        1141
#define P2MODE0                       1142
#define P2MODE1                       1143
#define P2MODE2                       1144
#define P2MODE3                       1145
#define P2DBRE                        1146
#define P2DBFE                        1147
#define PSMC2LD                       1148
#define PSMC2EN                       1149
#define PSMC2MDL                      1150
#define P2MSRC                        1151
#define P2MSRC0                       1152
#define P2MSRC1                       1153
#define P2MSRC2                       1154
#define P2MSRC3                       1155
#define P2MDLBIT                      1156
#define P2MDLPOL                      1157
#define P2MDLEN                       1158
#define PSMC2SYNC                     1159
#define P2SYNC0                       1160
#define P2SYNC1                       1161
#define P2SYNC2                       1162
#define P2DCPOL                       1163
#define P2PRPOL                       1164
#define P2POFST                       1165
#define PSMC2CLK                      1166
#define P2CSRC0                       1167
#define P2CSRC                        1168
#define P2CSRC1                       1169
#define P2CPRE                        1170
#define P2CPRE0                       1171
#define P2CPRE1                       1172
#define PSMC2OEN                      1173
#define P2OEA                         1174
#define P2OEB                         1175
#define PSMC2POL                      1176
#define P2POLA                        1177
#define P2POLB                        1178
#define P2INPOL                       1179
#define PSMC2BLNK                     1180
#define P2REBM                        1181
#define P2REBM0                       1182
#define P2REBM1                       1183
#define P2FEBM0                       1184
#define P2FEBM                        1185
#define P2FEBM1                       1186
#define PSMC2REBS                     1187
#define P2REBSC1                      1188
#define P2REBSC2                      1189
#define P2REBSC3                      1190
#define P2REBSC4                      1191
#define P2REBSIN                      1192
#define PSMC2FEBS                     1193
#define P2FEBSC1                      1194
#define P2FEBSC2                      1195
#define P2FEBSC3                      1196
#define P2FEBSC4                      1197
#define P2FEBSIN                      1198
#define PSMC2PHS                      1199
#define P2PHST                        1200
#define P2PHSC1                       1201
#define P2PHSC2                       1202
#define P2PHSC3                       1203
#define P2PHSC4                       1204
#define P2PHSIN                       1205
#define PSMC2DCS                      1206
#define P2DCST                        1207
#define P2DCSC1                       1208
#define P2DCSC2                       1209
#define P2DCSC3                       1210
#define P2DCSC4                       1211
#define P2DCSIN                       1212
#define PSMC2PRS                      1213
#define P2PRST                        1214
#define P2PRSC1                       1215
#define P2PRSC2                       1216
#define P2PRSC3                       1217
#define P2PRSC4                       1218
#define P2PRSIN                       1219
#define PSMC2ASDC                     1220
#define P2ASDOV                       1221
#define P2ARSEN                       1222
#define P2ASDEN                       1223
#define P2ASE                         1224
#define PSMC2ASDL                     1225
#define P2ASDLA                       1226
#define P2ASDLB                       1227
#define PSMC2ASDS                     1228
#define P2ASDSC1                      1229
#define P2ASDSC2                      1230
#define P2ASDSC3                      1231
#define P2ASDSC4                      1232
#define P2ASDSIN                      1233
#define PSMC2INT                      1234
#define P2TPRIF                       1235
#define P2TDCIF                       1236
#define P2TPHIF                       1237
#define P2TOVIF                       1238
#define P2TPRIE                       1239
#define P2TDCIE                       1240
#define P2TPHIE                       1241
#define P2TOVIE                       1242
#define PSMC2PHL                      1243
#define PSMC2PH0                      1244
#define PSMC2PH1                      1245
#define PSMC2PH2                      1246
#define PSMC2PH3                      1247
#define PSMC2PH4                      1248
#define PSMC2PH5                      1249
#define PSMC2PH6                      1250
#define PSMC2PH7                      1251
#define PSMC2PHH                      1252
#define PSMC2PH8                      1253
#define PSMC2PH9                      1254
#define PSMC2PH10                     1255
#define PSMC2PH11                     1256
#define PSMC2PH12                     1257
#define PSMC2PH13                     1258
#define PSMC2PH14                     1259
#define PSMC2PH15                     1260
#define PSMC2DCL                      1261
#define PSMC2DC0                      1262
#define PSMC2DC1                      1263
#define PSMC2DC2                      1264
#define PSMC2DC3                      1265
#define PSMC2DC4                      1266
#define PSMC2DC5                      1267
#define PSMC2DC6                      1268
#define PSMC2DC7                      1269
#define PSMC2DCH                      1270
#define PSMC2DC8                      1271
#define PSMC2DC9                      1272
#define PSMC2DC10                     1273
#define PSMC2DC11                     1274
#define PSMC2DC12                     1275
#define PSMC2DC13                     1276
#define PSMC2DC14                     1277
#define PSMC2DC15                     1278
#define PSMC2PRL                      1279
#define PSMC2PR0                      1280
#define PSMC2PR1                      1281
#define PSMC2PR2                      1282
#define PSMC2PR3                      1283
#define PSMC2PR4                      1284
#define PSMC2PR5                      1285
#define PSMC2PR6                      1286
#define PSMC2PR7                      1287
#define PSMC2PRH                      1288
#define PSMC2PR8                      1289
#define PSMC2PR9                      1290
#define PSMC2PR10                     1291
#define PSMC2PR11                     1292
#define PSMC2PR12                     1293
#define PSMC2PR13                     1294
#define PSMC2PR14                     1295
#define PSMC2PR15                     1296
#define PSMC2TMRL                     1297
#define PSMC2TMR0                     1298
#define PSMC2TMR1                     1299
#define PSMC2TMR2                     1300
#define PSMC2TMR3                     1301
#define PSMC2TMR4                     1302
#define PSMC2TMR5                     1303
#define PSMC2TMR6                     1304
#define PSMC2TMR7                     1305
#define PSMC2TMRH                     1306
#define PSMC2TMR8                     1307
#define PSMC2TMR9                     1308
#define PSMC2TMR10                    1309
#define PSMC2TMR11                    1310
#define PSMC2TMR12                    1311
#define PSMC2TMR13                    1312
#define PSMC2TMR14                    1313
#define PSMC2TMR15                    1314
#define PSMC2DBR                      1315
#define PSMC2DBR0                     1316
#define PSMC2DBR1                     1317
#define PSMC2DBR2                     1318
#define PSMC2DBR3                     1319
#define PSMC2DBR4                     1320
#define PSMC2DBR5                     1321
#define PSMC2DBR6                     1322
#define PSMC2DBR7                     1323
#define PSMC2DBF                      1324
#define PSMC2DBF0                     1325
#define PSMC2DBF1                     1326
#define PSMC2DBF2                     1327
#define PSMC2DBF3                     1328
#define PSMC2DBF4                     1329
#define PSMC2DBF5                     1330
#define PSMC2DBF6                     1331
#define PSMC2DBF7                     1332
#define PSMC2BLKR                     1333
#define PSMC2BLKR0                    1334
#define PSMC2BLKR1                    1335
#define PSMC2BLKR2                    1336
#define PSMC2BLKR3                    1337
#define PSMC2BLKR4                    1338
#define PSMC2BLKR5                    1339
#define PSMC2BLKR6                    1340
#define PSMC2BLKR7                    1341
#define PSMC2BLKF                     1342
#define PSMC2BLKF0                    1343
#define PSMC2BLKF1                    1344
#define PSMC2BLKF2                    1345
#define PSMC2BLKF3                    1346
#define PSMC2BLKF4                    1347
#define PSMC2BLKF5                    1348
#define PSMC2BLKF6                    1349
#define PSMC2BLKF7                    1350
#define PSMC2FFA                      1351
#define PSMC2FFA0                     1352
#define PSMC2FFA1                     1353
#define PSMC2FFA2                     1354
#define PSMC2FFA3                     1355
#define PSMC2STR0                     1356
#define P2STRA                        1357
#define P2STRB                        1358
#define PSMC2STR1                     1359
#define P2HSMEN                       1360
#define P2LSMEN                       1361
#define P2SSYNC                       1362
#define PSMC3CON                      1363
#define P3MODE                        1364
#define P3MODE0                       1365
#define P3MODE1                       1366
#define P3MODE2                       1367
#define P3MODE3                       1368
#define P3DBRE                        1369
#define P3DBFE                        1370
#define PSMC3LD                       1371
#define PSMC3EN                       1372
#define PSMC3MDL                      1373
#define P3MSRC                        1374
#define P3MSRC0                       1375
#define P3MSRC1                       1376
#define P3MSRC2                       1377
#define P3MSRC3                       1378
#define P3MDLBIT                      1379
#define P3MDLPOL                      1380
#define P3MDLEN                       1381
#define PSMC3SYNC                     1382
#define P3SYNC0                       1383
#define P3SYNC1                       1384
#define P3SYNC2                       1385
#define P3DCPOL                       1386
#define P3PRPOL                       1387
#define P3POFST                       1388
#define PSMC3CLK                      1389
#define P3CSRC0                       1390
#define P3CSRC                        1391
#define P3CSRC1                       1392
#define P3CPRE                        1393
#define P3CPRE0                       1394
#define P3CPRE1                       1395
#define PSMC3OEN                      1396
#define P3OEA                         1397
#define P3OEB                         1398
#define PSMC3POL                      1399
#define P3POLA                        1400
#define P3POLB                        1401
#define P3INPOL                       1402
#define PSMC3BLNK                     1403
#define P3REBM                        1404
#define P3REBM0                       1405
#define P3REBM1                       1406
#define P3FEBM                        1407
#define P3FEBM0                       1408
#define P3FEBM1                       1409
#define PSMC3REBS                     1410
#define P3REBSC1                      1411
#define P3REBSC2                      1412
#define P3REBSC3                      1413
#define P3REBSC4                      1414
#define P3REBSIN                      1415
#define PSMC3FEBS                     1416
#define P3FEBSC1                      1417
#define P3FEBSC2                      1418
#define P3FEBSC3                      1419
#define P3FEBSC4                      1420
#define P3FEBSIN                      1421
#define PSMC3PHS                      1422
#define P3PHST                        1423
#define P3PHSC1                       1424
#define P3PHSC2                       1425
#define P3PHSC3                       1426
#define P3PHSC4                       1427
#define P3PHSIN                       1428
#define PSMC3DCS                      1429
#define P3DCST                        1430
#define P3DCSC1                       1431
#define P3DCSC2                       1432
#define P3DCSC3                       1433
#define P3DCSC4                       1434
#define P3DCSIN                       1435
#define PSMC3PRS                      1436
#define P3PRST                        1437
#define P3PRSC1                       1438
#define P3PRSC2                       1439
#define P3PRSC3                       1440
#define P3PRSC4                       1441
#define P3PRSIN                       1442
#define PSMC3ASDC                     1443
#define P3ASDOV                       1444
#define P3ARSEN                       1445
#define P3ASDEN                       1446
#define P3ASE                         1447
#define PSMC3ASDL                     1448
#define P3ASDLA                       1449
#define P3ASDLB                       1450
#define PSMC3ASDS                     1451
#define P3ASDSC1                      1452
#define P3ASDSC2                      1453
#define P3ASDSC3                      1454
#define P3ASDSC4                      1455
#define P3ASDSIN                      1456
#define PSMC3INT                      1457
#define P3TPRIF                       1458
#define P3TDCIF                       1459
#define P3TPHIF                       1460
#define P3TOVIF                       1461
#define P3TPRIE                       1462
#define P3TDCIE                       1463
#define P3TPHIE                       1464
#define P3TOVIE                       1465
#define PSMC3PHL                      1466
#define PSMC3PH0                      1467
#define PSMC3PH1                      1468
#define PSMC3PH2                      1469
#define PSMC3PH3                      1470
#define PSMC3PH4                      1471
#define PSMC3PH5                      1472
#define PSMC3PH6                      1473
#define PSMC3PH7                      1474
#define PSMC3PHH                      1475
#define PSMC3PH8                      1476
#define PSMC3PH9                      1477
#define PSMC3PH10                     1478
#define PSMC3PH11                     1479
#define PSMC3PH12                     1480
#define PSMC3PH13                     1481
#define PSMC3PH14                     1482
#define PSMC3PH15                     1483
#define PSMC3DCL                      1484
#define PSMC3DC0                      1485
#define PSMC3DC1                      1486
#define PSMC3DC2                      1487
#define PSMC3DC3                      1488
#define PSMC3DC4                      1489
#define PSMC3DC5                      1490
#define PSMC3DC6                      1491
#define PSMC3DC7                      1492
#define PSMC3DCH                      1493
#define PSMC3DC8                      1494
#define PSMC3DC9                      1495
#define PSMC3DC10                     1496
#define PSMC3DC11                     1497
#define PSMC3DC12                     1498
#define PSMC3DC13                     1499
#define PSMC3DC14                     1500
#define PSMC3DC15                     1501
#define PSMC3PRL                      1502
#define PSMC3PR0                      1503
#define PSMC3PR1                      1504
#define PSMC3PR2                      1505
#define PSMC3PR3                      1506
#define PSMC3PR4                      1507
#define PSMC3PR5                      1508
#define PSMC3PR6                      1509
#define PSMC3PR7                      1510
#define PSMC3PRH                      1511
#define PSMC3PR8                      1512
#define PSMC3PR9                      1513
#define PSMC3PR10                     1514
#define PSMC3PR11                     1515
#define PSMC3PR12                     1516
#define PSMC3PR13                     1517
#define PSMC3PR14                     1518
#define PSMC3PR15                     1519
#define PSMC3TMRL                     1520
#define PSMC3TMR0                     1521
#define PSMC3TMR1                     1522
#define PSMC3TMR2                     1523
#define PSMC3TMR3                     1524
#define PSMC3TMR4                     1525
#define PSMC3TMR5                     1526
#define PSMC3TMR6                     1527
#define PSMC3TMR7                     1528
#define PSMC3TMRH                     1529
#define PSMC3TMR8                     1530
#define PSMC3TMR9                     1531
#define PSMC3TMR10                    1532
#define PSMC3TMR11                    1533
#define PSMC3TMR12                    1534
#define PSMC3TMR13                    1535
#define PSMC3TMR14                    1536
#define PSMC3TMR15                    1537
#define PSMC3DBR                      1538
#define PSMC3DBR0                     1539
#define PSMC3DBR1                     1540
#define PSMC3DBR2                     1541
#define PSMC3DBR3                     1542
#define PSMC3DBR4                     1543
#define PSMC3DBR5                     1544
#define PSMC3DBR6                     1545
#define PSMC3DBR7                     1546
#define PSMC3DBF                      1547
#define PSMC3DBF0                     1548
#define PSMC3DBF1                     1549
#define PSMC3DBF2                     1550
#define PSMC3DBF3                     1551
#define PSMC3DBF4                     1552
#define PSMC3DBF5                     1553
#define PSMC3DBF6                     1554
#define PSMC3DBF7                     1555
#define PSMC3BLKR                     1556
#define PSMC3BLKR0                    1557
#define PSMC3BLKR1                    1558
#define PSMC3BLKR2                    1559
#define PSMC3BLKR3                    1560
#define PSMC3BLKR4                    1561
#define PSMC3BLKR5                    1562
#define PSMC3BLKR6                    1563
#define PSMC3BLKR7                    1564
#define PSMC3BLKF                     1565
#define PSMC3BLKF0                    1566
#define PSMC3BLKF1                    1567
#define PSMC3BLKF2                    1568
#define PSMC3BLKF3                    1569
#define PSMC3BLKF4                    1570
#define PSMC3BLKF5                    1571
#define PSMC3BLKF6                    1572
#define PSMC3BLKF7                    1573
#define PSMC3FFA                      1574
#define PSMC3FFA0                     1575
#define PSMC3FFA1                     1576
#define PSMC3FFA2                     1577
#define PSMC3FFA3                     1578
#define PSMC3STR0                     1579
#define P3STRA                        1580
#define P3STRB                        1581
#define PSMC3STR1                     1582
#define P3HSMEN                       1583
#define P3LSMEN                       1584
#define P3SSYNC                       1585
#define PSMC4CON                      1586
#define P4MODE                        1587
#define P4MODE0                       1588
#define P4MODE1                       1589
#define P4MODE2                       1590
#define P4MODE3                       1591
#define P4DBRE                        1592
#define P4DBFE                        1593
#define PSMC4LD                       1594
#define PSMC4EN                       1595
#define PSMC4MDL                      1596
#define P4MSRC                        1597
#define P4MSRC0                       1598
#define P4MSRC1                       1599
#define P4MSRC2                       1600
#define P4MSRC3                       1601
#define P4MDLBIT                      1602
#define P4MDLPOL                      1603
#define P4MDLEN                       1604
#define PSMC4SYNC                     1605
#define P4SYNC0                       1606
#define P4SYNC1                       1607
#define P4SYNC2                       1608
#define P4DCPOL                       1609
#define P4PRPOL                       1610
#define P4POFST                       1611
#define PSMC4CLK                      1612
#define P4CSRC0                       1613
#define P4CSRC                        1614
#define P4CSRC1                       1615
#define P4CPRE0                       1616
#define P4CPRE                        1617
#define P4CPRE1                       1618
#define PSMC4OEN                      1619
#define P4OEA                         1620
#define P4OEB                         1621
#define PSMC4POL                      1622
#define P4POLA                        1623
#define P4POLB                        1624
#define P4INPOL                       1625
#define PSMC4BLNK                     1626
#define P4REBM0                       1627
#define P4REBM                        1628
#define P4REBM1                       1629
#define P4FEBM0                       1630
#define P4FEBM                        1631
#define P4FEBM1                       1632
#define PSMC4REBS                     1633
#define P4REBSC1                      1634
#define P4REBSC2                      1635
#define P4REBSC3                      1636
#define P4REBSC4                      1637
#define P4REBSIN                      1638
#define PSMC4FEBS                     1639
#define P4FEBSC1                      1640
#define P4FEBSC2                      1641
#define P4FEBSC3                      1642
#define P4FEBSC4                      1643
#define P4FEBSIN                      1644
#define PSMC4PHS                      1645
#define P4PHST                        1646
#define P4PHSC1                       1647
#define P4PHSC2                       1648
