tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1788_tdd.h
#define P4PHSC3                       1649
#define P4PHSC4                       1650
#define P4PHSIN                       1651
#define PSMC4DCS                      1652
#define P4DCST                        1653
#define P4DCSC1                       1654
#define P4DCSC2                       1655
#define P4DCSC3                       1656
#define P4DCSC4                       1657
#define P4DCSIN                       1658
#define PSMC4PRS                      1659
#define P4PRST                        1660
#define P4PRSC1                       1661
#define P4PRSC2                       1662
#define P4PRSC3                       1663
#define P4PRSC4                       1664
#define P4PRSIN                       1665
#define PSMC4ASDC                     1666
#define P4ASDOV                       1667
#define P4ARSEN                       1668
#define P4ASDEN                       1669
#define P4ASE                         1670
#define PSMC4ASDL                     1671
#define P4ASDLA                       1672
#define P4ASDLB                       1673
#define PSMC4ASDS                     1674
#define P4ASDSC1                      1675
#define P4ASDSC2                      1676
#define P4ASDSC3                      1677
#define P4ASDSC4                      1678
#define P4ASDSIN                      1679
#define PSMC4INT                      1680
#define P4TPRIF                       1681
#define P4TDCIF                       1682
#define P4TPHIF                       1683
#define P4TOVIF                       1684
#define P4TPRIE                       1685
#define P4TDCIE                       1686
#define P4TPHIE                       1687
#define P4TOVIE                       1688
#define PSMC4PHL                      1689
#define PSMC4PH0                      1690
#define PSMC4PH1                      1691
#define PSMC4PH2                      1692
#define PSMC4PH3                      1693
#define PSMC4PH4                      1694
#define PSMC4PH5                      1695
#define PSMC4PH6                      1696
#define PSMC4PH7                      1697
#define PSMC4PHH                      1698
#define PSMC4PH8                      1699
#define PSMC4PH9                      1700
#define PSMC4PH10                     1701
#define PSMC4PH11                     1702
#define PSMC4PH12                     1703
#define PSMC4PH13                     1704
#define PSMC4PH14                     1705
#define PSMC4PH15                     1706
#define PSMC4DCL                      1707
#define PSMC4DC0                      1708
#define PSMC4DC1                      1709
#define PSMC4DC2                      1710
#define PSMC4DC3                      1711
#define PSMC4DC4                      1712
#define PSMC4DC5                      1713
#define PSMC4DC6                      1714
#define PSMC4DC7                      1715
#define PSMC4DCH                      1716
#define PSMC4DC8                      1717
#define PSMC4DC9                      1718
#define PSMC4DC10                     1719
#define PSMC4DC11                     1720
#define PSMC4DC12                     1721
#define PSMC4DC13                     1722
#define PSMC4DC14                     1723
#define PSMC4DC15                     1724
#define PSMC4PRL                      1725
#define PSMC4PR0                      1726
#define PSMC4PR1                      1727
#define PSMC4PR2                      1728
#define PSMC4PR3                      1729
#define PSMC4PR4                      1730
#define PSMC4PR5                      1731
#define PSMC4PR6                      1732
#define PSMC4PR7                      1733
#define PSMC4PRH                      1734
#define PSMC4PR8                      1735
#define PSMC4PR9                      1736
#define PSMC4PR10                     1737
#define PSMC4PR11                     1738
#define PSMC4PR12                     1739
#define PSMC4PR13                     1740
#define PSMC4PR14                     1741
#define PSMC4PR15                     1742
#define PSMC4TMRL                     1743
#define PSMC4TMR0                     1744
#define PSMC4TMR1                     1745
#define PSMC4TMR2                     1746
#define PSMC4TMR3                     1747
#define PSMC4TMR4                     1748
#define PSMC4TMR5                     1749
#define PSMC4TMR6                     1750
#define PSMC4TMR7                     1751
#define PSMC4TMRH                     1752
#define PSMC4TMR8                     1753
#define PSMC4TMR9                     1754
#define PSMC4TMR10                    1755
#define PSMC4TMR11                    1756
#define PSMC4TMR12                    1757
#define PSMC4TMR13                    1758
#define PSMC4TMR14                    1759
#define PSMC4TMR15                    1760
#define PSMC4DBR                      1761
#define PSMC4DBR0                     1762
#define PSMC4DBR1                     1763
#define PSMC4DBR2                     1764
#define PSMC4DBR3                     1765
#define PSMC4DBR4                     1766
#define PSMC4DBR5                     1767
#define PSMC4DBR6                     1768
#define PSMC4DBR7                     1769
#define PSMC4DBF                      1770
#define PSMC4DBF0                     1771
#define PSMC4DBF1                     1772
#define PSMC4DBF2                     1773
#define PSMC4DBF3                     1774
#define PSMC4DBF4                     1775
#define PSMC4DBF5                     1776
#define PSMC4DBF6                     1777
#define PSMC4DBF7                     1778
#define PSMC4BLKR                     1779
#define PSMC4BLKR0                    1780
#define PSMC4BLKR1                    1781
#define PSMC4BLKR2                    1782
#define PSMC4BLKR3                    1783
#define PSMC4BLKR4                    1784
#define PSMC4BLKR5                    1785
#define PSMC4BLKR6                    1786
#define PSMC4BLKR7                    1787
#define PSMC4BLKF                     1788
#define PSMC4BLKF0                    1789
#define PSMC4BLKF1                    1790
#define PSMC4BLKF2                    1791
#define PSMC4BLKF3                    1792
#define PSMC4BLKF4                    1793
#define PSMC4BLKF5                    1794
#define PSMC4BLKF6                    1795
#define PSMC4BLKF7                    1796
#define PSMC4FFA                      1797
#define PSMC4FFA0                     1798
#define PSMC4FFA1                     1799
#define PSMC4FFA2                     1800
#define PSMC4FFA3                     1801
#define PSMC4STR0                     1802
#define P4STRA                        1803
#define P4STRB                        1804
#define PSMC4STR1                     1805
#define P4HSMEN                       1806
#define P4LSMEN                       1807
#define P4SSYNC                       1808
#define STATUS_SHAD                   1809
#define C_SHAD                        1810
#define DC_SHAD                       1811
#define Z_SHAD                        1812
#define WREG_SHAD                     1813
#define BSR_SHAD                      1814
#define PCLATH_SHAD                   1815
#define FSR0L_SHAD                    1816
#define FSR0H_SHAD                    1817
#define FSR1L_SHAD                    1818
#define FSR1H_SHAD                    1819
#define STKPTR                        1820
#define TOSL                          1821
#define TOSH                          1822

#endif // _PIC16F1788_H_
